src/Reports/ОтчетПоВыработкеВЛинейках/ОтчетПоВыработкеВЛинейках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоВыработкеВЛинейках</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ПаспортЛинейки/ПаспортЛинейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПаспортЛинейки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВремяТактаМаксимальное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяТактаМинимальное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяТактаРасчётное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыпускЗаДеньРасчётный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ТехническийЛидер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Смена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ОтчетПоВыработкеВЛинейках/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ОтборПо = 1;
СписокРолей = ОбщийМодульВызовСервера.ПолучитьСписокРолей();
	Для каждого Роль Из СписокРолей Цикл
		Если Найти(Роль.Значение,"АРМ") > 0 Тогда
		Исполнитель = ПараметрыСеанса.Пользователь;
		Элементы.Исполнитель.Доступность = Ложь; 
		Возврат;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

Макет = Отчеты.ОтчетПоВыработкеВЛинейках.ПолучитьМакет("Макет"); 
ОблШапкаОбщая = Макет.ПолучитьОбласть("Шапка|Общая");
ОблШапкаДата = Макет.ПолучитьОбласть("Шапка|Дата");
ОблШапкаИтого = Макет.ПолучитьОбласть("Шапка|Итого");	
ОблРМОбщая = Макет.ПолучитьОбласть("РМ|Общая");
ОблРМДата = Макет.ПолучитьОбласть("РМ|Дата");
ОблРМИтого = Макет.ПолучитьОбласть("РМ|Итого");

ОблШапкаОбщая.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапкаОбщая.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапкаОбщая.Параметры.Линейка = ""+СписокРМ[0].Значение.Линейка + " ("+СписокРМ[0].Значение.Линейка.Комментарий+")";

Отбор = Новый Структура("Линейка",СписокРМ[0].Значение.Линейка);
ПаспортЛинейки = РегистрыСведений.ПаспортЛинейки.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Отбор);
ОблШапкаОбщая.Параметры.КолВыпускРасч = ПаспортЛинейки.ВыпускЗаДеньРасчётный;
ТабДок.Вывести(ОблШапкаОбщая);
ВыбДата = Отчет.Период.ДатаНачала;
	Пока ВыбДата <= Отчет.Период.ДатаОкончания Цикл
	ОблШапкаДата.Параметры.ВыбДата = Формат(ВыбДата,"ДФ=dd.MM.yyyy");
	ТабДок.Присоединить(ОблШапкаДата);
	ВыбДата = ВыбДата + 86400;
	КонецЦикла;
ТабДок.Присоединить(ОблШапкаИтого);

Запрос = Новый Запрос;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданий.РабочееМесто КАК РабочееМесто,
	|	ЭтапыПроизводственныхЗаданий.Исполнитель КАК Исполнитель,
	|	ЭтапыПроизводственныхЗаданий.ДатаОкончания КАК ДатаОкончания,
	|	ЭтапыПроизводственныхЗаданий.Изделие КАК Изделие,
	|	ЭтапыПроизводственныхЗаданий.Количество
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий КАК ЭтапыПроизводственныхЗаданий
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданий.РабочееМесто В ИЕРАРХИИ(&СписокРМ)
	|	И ЭтапыПроизводственныхЗаданий.ДатаОкончания МЕЖДУ &ДатаНач И &ДатаКон";
	Если Не Исполнитель.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + "	И ЭтапыПроизводственныхЗаданий.Исполнитель = &Исполнитель";
	Запрос.УстановитьПараметр("Исполнитель",Исполнитель);
	КонецЕсли;
		Если ОтборПо = 2 Тогда
		Запрос.Текст = Запрос.Текст + "	И ЭтапыПроизводственныхЗаданий.ПЗ.ДокументОснование.Ремонт = ЛОЖЬ";
		ИначеЕсли ОтборПо = 3 Тогда
		Запрос.Текст = Запрос.Текст + "	И ЭтапыПроизводственныхЗаданий.ПЗ.ДокументОснование.Ремонт = ИСТИНА";	
		КонецЕсли;
Запрос.Текст = Запрос.Текст + "	УПОРЯДОЧИТЬ ПО ЭтапыПроизводственныхЗаданий.РабочееМесто.Код
							  |ИТОГИ ПО РабочееМесто,Исполнитель";	
Запрос.УстановитьПараметр("СписокРМ",СписокРМ);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Результат = Запрос.Выполнить();
ВыборкаРМ = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРМ.Следующий() Цикл
	РМ = ВыборкаРМ.РабочееМесто;
	ВыборкаИсполнитель = ВыборкаРМ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИсполнитель.Следующий() Цикл
		КолИтого = 0;
		КолУслИтого = 0;
		ОблРМОбщая.Параметры.РМ = РМ;
		ОблРМОбщая.Параметры.Исполнитель = СокрЛП(ВыборкаИсполнитель.Исполнитель.Наименование);
		ТабДок.Вывести(ОблРМОбщая);
		ВыборкаДата = ВыборкаИсполнитель.Выбрать(ОбходРезультатаЗапроса.Прямой);
		ВыбДата = Отчет.Период.ДатаНачала;
			Пока ВыбДата <= Отчет.Период.ДатаОкончания Цикл
			Кол = 0;
			КолУсл = 0;
			ВыбДатаДата = Формат(ВыбДата,"ДФ=dd.MM.yyyy");
			ВыборкаДата.Сбросить();
				Пока ВыборкаДата.Следующий() Цикл
					Если Формат(ВыборкаДата.ДатаОкончания,"ДФ=dd.MM.yyyy") = ВыбДатаДата Тогда
					Кол = Кол + ВыборкаДата.Количество;
					КолУсл = КолУсл + ВыборкаДата.Изделие.УсловныеПриборы*ВыборкаДата.Количество;
					КолИтого = КолИтого + ВыборкаДата.Количество;
					КолУслИтого = КолУслИтого + ВыборкаДата.Изделие.УсловныеПриборы*ВыборкаДата.Количество;
					КонецЕсли; 
				КонецЦикла;
			ОблРМДата.Параметры.Кол = Кол;
			ОблРМДата.Параметры.КолУсл = КолУсл;
			ТабДок.Присоединить(ОблРМДата);
			ВыбДата = ВыбДата + 86400;
			КонецЦикла;
		ОблРМИтого.Параметры.КолИтого = КолИтого;
		ОблРМИтого.Параметры.КолУслИтого = КолУслИтого;		
		ТабДок.Присоединить(ОблРМИтого);
		КонецЦикла;	
	КонецЦикла;
ТабДок.ФиксацияСверху = 4;
ТабДок.ФиксацияСлева = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НастройкиНаСервере()
Настройки = Новый Структура("ОтборПо,СписокРМ",ОтборПо,СписокРМ);
Возврат(Новый Структура("КлючНазначенияИспользования,Настройки","ОтчетПоВыработкеВЛинейках",Настройки));
КонецФункции

&НаКлиенте
Процедура Настройки(Команда)
Результат = ОткрытьФормуМодально("ОбщаяФорма.НастройкиФорм",НастройкиНаСервере());
	Если Результат <> Неопределено Тогда	
	ОтборПо = Результат.ОтборПо;
	СписокРМ = Результат.СписокРМ;	
	КонецЕсли;
КонецПроцедуры
